In [15]:
import pandas as pd

# Membuat dataframe dengan missing values (nilai NaN)
data = {
    'Name'  : [  'John',   'Anna',   'Peter', 'Linda',     None],
    'Age'   : [    28,       24,        35,     None,       22],
    'City'  : ['New York', 'Paris',    None,   'Berlin', 'London'],
    'Income': [  70000,    48000,     59000,   52000,     None]
}

df = pd.DataFrame(data)
print(df)

    Name   Age      City   Income
0   John  28.0  New York  70000.0
1   Anna  24.0     Paris  48000.0
2  Peter  35.0      None  59000.0
3  Linda   NaN    Berlin  52000.0
4   None  22.0    London      NaN

In [16]:
df_cleaned = df.dropna()
print(df_cleaned)

   Name   Age      City   Income
0  John  28.0  New York  70000.0
1  Anna  24.0     Paris  48000.0

In [25]:

df_filled = df.fillna({
    'Name': 'iqbal',   # Mengisi nama yang hilang dengan 'Unknown'
    'Age': '20',  # Mengisi umur yang hilang dengan rata-rata umur
    'City': 'Spain',   # Mengisi kota yang hilang dengan 'Unknown'
    'Income': df['Income'].mean()  # Mengisi pendapatan yang hilang dengan rata-rata pendapatan
})

print("Data setelah mengisi missing values:")
print(df_filled)

Data setelah mengisi missing values:
    Name   Age      City   Income
0   John  28.0  New York  70000.0
1   Anna  24.0     Paris  48000.0
2  Peter  35.0     Spain  59000.0
3  Linda    20    Berlin  52000.0
4  iqbal  22.0    London  57250.0

In [19]:

print(df.isnull())

print(df.isnull().sum())

    Name    Age   City  Income
0  False  False  False   False
1  False  False  False   False
2  False  False   True   False
3  False   True  False   False
4   True  False  False    True
Name      1
Age       1
City      1
Income    1
dtype: int64

In [20]:

df_interpolated = df.interpolate()

print(df_interpolated)

    Name   Age      City   Income
0   John  28.0  New York  70000.0
1   Anna  24.0     Paris  48000.0
2  Peter  35.0      None  59000.0
3  Linda  28.5    Berlin  52000.0
4   None  22.0    London  52000.0

<ipython-input-20-0a77954c81b5>:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate()